import string
import time 
import random
code = ("Ꝉ", "ꝉ", "Ꝋ", "ꝋ", "Ꝍ", "ꝍ", "Ꝏ", "ꝏ", "Ꝑ", "ꝑ", "Ꝓ", "ꝓ", "Ꝕ",
        "ꝕ", "Ꝗ", "ꝗ", "Ꝙ", "ꝙ", "Ꝛ", "ꝛ", "Ꝝ", "ꝝ", "Ꝟ", "ꝟ", "Ꝡ", "ꝡ",
        "Ꝣ", "ꝣ", "Ꝥ", "ꝥ", "Ꝧ", "ꝧ", "Ꝩ", "ꝩ", "Ꝫ", "ꝫ", "Ꝭ", "ꝭ", "Ꝯ", "ꝯ",
          "ꝰ", "ꝱ", "ꝲ", "ꝴ", "ꝵ", "ꝷ", "ꝸ", "ꝺ", "Ꝼ", "Ꝼ", "ꝼ", "Ᵹ", "Ꝿ", "ꝿ",
            "Ꞁ", "ꞁ", "Ꞃ", "ꞃ", "Ꞅ", "ꞅ", "Ꞇ", "ꞇ", "ꞈ", "꞉", "꞊", "Ꞌ", "ꞌ",
              "Ɥ", "ꞎ", "ꞏ", "Ꞑ", "ꞑ", "Ꞓ", "ꞓ", "ꞔ", "ꞕ", "Ꞗ", "ꞗ", "Ꞙ", "ꞙ",
                "Ꞛ", "ꞛ", "Ꞝ", "ꞝ", "Ꞟ", "ꞟ", "Ꞡ", "ꞡ", "Ꞣ", "ꞣ", "Ꞥ", "ꞥ", "Ꞧ",
                  "ꞧ", "Ꞩ", "ꞩ", "Ɦ", "Ɜ", "Ɡ", "Ɬ", "Ɪ", "ꞯ", "Ʞ", "Ʇ", "Ʝ", "Ꭓ",
                    "Ꞵ", "ꞵ", "Ꞷ", "ꞷ", "Ꞹ", "ꞹ", "Ꞻ", "ꞻ", "Ꞽ", "ꞽ", "Ꞿ", "ꞿ", "Ꟁ",
                      "ꟁ", "Ꟃ", "ꟃ", "Ꞔ", "Ʂ", "Ᶎ", "Ꟈ", "ꟈ", "Ꟊ", "ꟊ"
)
def encode():
    print("hello folkes!")
    print("enter the text ") 
    text = str(input("==>"))
    print("processing...")
    time.sleep(1)
    print("....")
    msg = [*text]
    for x in range(len(msg)):
        print(random.choice(code), end = "")
    print("\n")
    codedis = {"a" : ""}
    

while True:
    encode()    