import string
import time 
import random

code_1 = {'a': 'Ꝉ', 'b': 'ꝉ', 'c': 'Ꝋ', 'd': 'ꝋ', 'e': 'Ꝍ', 'f': 'ꝍ', 'g': 'Ꝏ', 'h': 'ꝏ', 'i': 'Ꝑ',
 'j': 'ꝑ', 'k': 'Ꝓ', 'l': 'ꝓ', 'm': 'Ꝕ', 'n': 'ꝕ', 'o': 'Ꝗ', 'p': 'ꝗ', 'q': 'Ꝙ', 'r': 'ꝙ',
 's': 'Ꝛ', 't': 'ꝛ', 'u': 'Ꝝ', 'v': 'ꝝ', 'w': 'Ꝟ', 'x': 'ꝟ', 'y': 'Ꝡ', 'z': 'ꝡ', ' ' : '^' , '.' :'~' , "'" : "*" , '!':'#'}
code_2 = {'a': 'Ꝿ', 'b': 'ꝿ', 'c': 'Ꞁ', 'd': 'ꞁ', 'e': 'Ꞃ', 'f': 'ꞃ', 'g': 'Ꞅ', 'h': 'ꞅ', 'i': 'Ꞇ',
 'j': 'ꞇ', 'k': 'ꞈ', 'l': '꞉', 'm': '꞊', 'n': 'Ꞌ', 'o': 'ꞌ', 'p': 'Ɥ', 'q': 'ꞎ', 'r': 'ꞏ',
 's': 'Ꞑ', 't': 'ꞑ', 'u': 'Ꞓ', 'v': 'ꞓ', 'w': 'ꞔ', 'x': 'ꞕ', 'y': 'Ꞗ', 'z': 'ꞗ', ' ' : '^' , '.' :'~' , "'" : "*" , '!':'#'}
code_3 = {'a': 'Ꝣ', 'b': 'ꝣ', 'c': 'Ꝥ', 'd': 'ꝥ', 'e': 'Ꝧ', 'f': 'ꝧ', 'g': 'Ꝩ', 'h': 'ꝩ', 'i': 'Ꝫ',
 'j': 'ꝫ', 'k': 'Ꝭ', 'l': 'ꝭ', 'm': 'Ꝯ', 'n': 'ꝯ', 'o': 'ꝰ', 'p': 'ꝱ', 'q': 'ꝲ', 'r': 'ꝴ',
 's': 'ꝵ', 't': 'ꝷ', 'u': 'ꝸ', 'v': 'ꝺ', 'w': 'Ꝼ', 'x': 'Ꝼ', 'y': 'ꝼ', 'z': 'Ᵹ', ' ' : '^' , '.' :'~' , "'" : "*" , '!':'#'}
code_4 = {'a': 'Ꞙ', 'b': 'ꞙ', 'c': 'Ꞛ', 'd': 'ꞛ', 'e': 'Ꞝ', 'f': 'ꞝ', 'g': 'Ꞟ', 'h': 'ꞟ', 'i': 'Ꞡ',
 'j': 'ꞡ', 'k': 'Ꞣ', 'l': 'ꞣ', 'm': 'Ꞥ', 'n': 'ꞥ', 'o': 'Ꞧ', 'p': 'ꞧ', 'q': 'Ꞩ', 'r': 'ꞩ',
 's': 'Ɦ', 't': 'Ɜ', 'u': 'Ɡ', 'v': 'Ɬ', 'w': 'Ɪ', 'x': 'ꞯ', 'y': 'Ʞ', 'z': 'Ʇ', ' ' : '^' , '.' :'~' , "'" : "*" , '!':'#'}
code_5 = {'a': 'Ʝ', 'b': 'Ꭓ', 'c': 'Ꞵ', 'd': 'ꞵ', 'e': 'Ꞷ', 'f': 'ꞷ', 'g': 'Ꞹ', 'h': 'ꞹ', 'i': 'Ꞻ',
 'j': 'ꞻ', 'k': 'Ꞽ', 'l': 'ꞽ', 'm': 'Ꞿ', 'n': 'ꞿ', 'o': 'Ꟁ', 'p': 'ꟁ', 'q': 'Ꟃ', 'r': 'ꟃ',
 's': 'Ꞔ', 't': 'Ʂ', 'u': 'Ᶎ', 'v': 'Ꟈ', 'w': 'ꟈ', 'x': 'Ꟊ', 'y': 'ꟊ', 'z' : 'ā', ' ' : '^' , '.' :'~' , "'" : "*" , '!':'#'} 




code_select = ("code_1" , "code_2", "code_3" , 'code_4' , 'code_5')

code = random.choice(code_select)
print(code)


def encode():
    print("hello folkes!")
    print("enter the text ") 
    text = str(input("==>"))
    print("processing...")
    time.sleep(1)
    print("....")
    msg = [*text]
    for x in range(len(msg)):
        print(random.choice(code), end = "")
    print("\n")
    codedis = {"a" : ""}
    
